Bwooce/tinygs_nRF52/src/main.cpp
        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d", ret);
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        /* Truncate long payloads for logging — full payload is still parsed */
        if (ret > 0) {
            char saved = 0;
            if (ret > 200) { saved = rx_payload[200]; rx_payload[200] = '\0'; }
            LOG_INF("  payload: %s%s", (char *)rx_payload, ret > 200 ? "..." : "");
            if (saved) { rx_payload[200] = saved; }
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            if (strcmp(cmnd, "begine") == 0 ||
                strcmp(cmnd, "batch_conf") == 0) {
                /* Reconfigure radio from JSON payload.
                 * Minimal parser — extract freq, sf, bw, cr, sat */
                if (radio != nullptr) {
                    const char *p;
                    bool iiq = false;
                    bool crc = true;

                    p = strstr((char *)rx_payload, "\"freq\":");
                    if (p) {
                        float freq = strtof(p + 7, NULL);
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                            /* Apply with frequency offset (foff) */
                            radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                        }
                    }
                    p = strstr((char *)rx_payload, "\"sf\":");
                    if (p) {
                        int sf = atoi(p + 5);
                        if (sf >= 5 && sf <= 12) {
                            radio->setSpreadingFactor(sf);
                            tinygs_radio.sf = sf;
                        }
                    }
                    p = strstr((char *)rx_payload, "\"bw\":");
                    if (p) {
                        float bw = strtof(p + 5, NULL);
                        radio->setBandwidth(bw);
                        tinygs_radio.bw = bw;
                    }
                    p = strstr((char *)rx_payload, "\"cr\":");
                    if (p) {
                        int cr = atoi(p + 5);
                        radio->setCodingRate(cr);
                        tinygs_radio.cr = cr;
                    }
                    p = strstr((char *)rx_payload, "\"sw\":");
                    if (p) radio->setSyncWord(atoi(p + 5));
                    p = strstr((char *)rx_payload, "\"pl\":");
                    if (p) radio->setPreambleLength(atoi(p + 5));
                    p = strstr((char *)rx_payload, "\"iIQ\":");
                    if (p) {
                        iiq = (strncmp(p + 6, "true", 4) == 0);
                        radio->invertIQ(iiq);
                    }
                    p = strstr((char *)rx_payload, "\"crc\":");
                    if (p) {
                        crc = (strncmp(p + 6, "true", 4) == 0);
                        radio->setCRC(crc ? 2 : 0);
                    }
                    p = strstr((char *)rx_payload, "\"sat\":\"");
                    if (p) {
                        const char *end = strchr(p + 7, '"');
                        if (end && (end - p - 7) < (int)sizeof(tinygs_radio.satellite)) {
                            memcpy(tinygs_radio.satellite, p + 7, end - p - 7);
                            tinygs_radio.satellite[end - p - 7] = '\0';
                        }
                    }
                    p = strstr((char *)rx_payload, "\"NORAD\":");
                    if (p) tinygs_radio.norad = (uint32_t)atoi(p + 8);

                    /* Parse filter from begine payload */
                    p = strstr((char *)rx_payload, "\"filter\":[");
                    if (p) {
                        p += 10;
                        tinygs_radio.filter_len = 0;
                        while (*p && *p != ']' && tinygs_radio.filter_len < sizeof(tinygs_radio.filter)) {
                            while (*p == ' ' || *p == ',') p++;
                            if (*p == ']') break;
                            tinygs_radio.filter[tinygs_radio.filter_len++] = (uint8_t)atoi(p);
                            while (*p && *p != ',' && *p != ']') p++;
                        }
                    } else {
                        tinygs_radio.filter_len = 0;
                        tinygs_radio.filter[0] = 0;
                    }

                    /* Parse TLE (base64-encoded 34-byte binary) */
                    /* TLE is sent as "tlx" (not "tle") in the ESP32 protocol */
                    p = strstr((char *)rx_payload, "\"tlx\":\"");
                    if (p) {
                        const char *b64_start = p + 7;
                        const char *b64_end = strchr(b64_start, '"');
                        if (b64_end) {
                            size_t b64_len = b64_end - b64_start;
                            size_t decoded_len = 0;
                            if (base64_decode((uint8_t *)tinygs_radio.tle,
                                              sizeof(tinygs_radio.tle),
                                              &decoded_len,
                                              (const uint8_t *)b64_start, b64_len) == 0
                                && decoded_len == 34) {
                                tinygs_radio.tle_valid = true;
                                tinygs_radio.freq_doppler = 0.0f;
                                LOG_INF("  TLE received (%zu bytes)", decoded_len);
                            } else {
                                tinygs_radio.tle_valid = false;
                            }
                        }
                    } else {
                        tinygs_radio.tle_valid = false;
                    }

                    /* Store raw payload as modem_conf — json_escape() in
                     * tinygs_build_welcome handles the quote escaping. */
                    size_t conf_len = strlen((char *)rx_payload);
                    if (conf_len < sizeof(tinygs_radio.modem_conf)) {
                        memcpy(tinygs_radio.modem_conf, rx_payload, conf_len + 1);
                    }

                    radio->startReceive();

